results/cpp_wrk.txt
Running 30s test @ http://127.0.0.1:8080/
  10 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.22ms   17.25ms 843.15ms   93.77%
    Req/Sec     4.15k     1.81k   13.39k    88.53%
  Latency Distribution
     50%   27.09ms
     75%   28.95ms
     90%   30.84ms
     99%   37.12ms
  1239464 requests in 30.04s, 466.92MB read
  Non-2xx or 3xx responses: 1239464
Requests/sec:  41258.31
Transfer/sec:     15.54MB