results/cpp_wrk.txt
Running 30s test @ http://127.0.0.1:8080/
  10 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.87ms    7.09ms  91.56ms   72.80%
    Req/Sec     6.72k   590.55    17.22k    73.10%
  Latency Distribution
     50%   13.71ms
     75%   18.51ms
     90%   23.86ms
     99%   37.31ms
  2004787 requests in 30.10s, 5.35GB read
  Non-2xx or 3xx responses: 666358
Requests/sec:  66595.37
Transfer/sec:    181.82MB