results/cpp_wrk.txt
Running 30s test @ http://127.0.0.1:8080/
  10 threads and 1000 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    85.17ms   85.20ms 485.65ms   83.16%
    Req/Sec     1.62k   192.59     2.82k    72.52%
  Latency Distribution
     50%   55.20ms
     75%   73.57ms
     90%  240.70ms
     99%  348.54ms
  484052 requests in 30.10s, 0.93GB read
  Non-2xx or 3xx responses: 266396
Requests/sec:  16082.89
Transfer/sec:     31.56MB